{"pages":[],"posts":[{"title":"TDD with React from User Stories to Development","text":"In this post, we're going to develop a React app using TDD (Test-Driven Development) from User Stories to Development. Also, we're gonna use Jest and Enzyme for the TDD. Upon completion, you will be able to: create Epics, User Stories based on the requirement create tests based on User Stories to develop a React app using TDD use Enzyme and Jest to test a React app use/reuse CSS variables for responsive design create a reusable React component that renders and functions differently based on the provided props type check component props using React PropTypes I assumed that you have basic knowledge of React at least. If you’re completely new to React, I’d recommend you to complete the offical https://reactjs.org/tutorial/tutorial.html tutorial. ContentsOverview We'll be building a basic pomodoro timer app consisting of some UI components. Each component will have a separate set of tests in a corresponding test file. First of all, we could create Epics, User Stories as follows based on the project requirement. Epic: As a user, I need to use the timer so that I can manage my time. User Story: As a user, I need to start the timer so that I can count down my time. Acceptance Criteria: Ensure the user is able to: start the timer see the timer start counting down User Story: As a user, I need to stop the timer so that I can count down my time only when needed.Acceptance Criteria: Ensure the user is able to: stop the timer see the timer stopped User Story: As a user, I need to restart the timer so that I can count down my time.Acceptance Criteria: Ensure the user is able to: restart the timer see the timer restarted User Story: As a user, I need to reset the timer so that I can count down my time from beginning.Acceptance Criteria: Ensure the user is able to: reset the timer see the timer reset to the default Epic: As a user, I need to choose a timer type so that I can manage my time according to the situation. User Story: As a user, I need to choose the pomodoro timer so that I can manage my working time. Acceptance Criteria: Ensure the user is able to: choose the pomodoro timer see the pomodoro timer chosen User Story: As a user, I need to choose the short-break timer so that I can manage my short-breaking time.Acceptance Criteria: Ensure the user is able to: choose the short-break timer see the short-break timer chosen User Story: As a user, I need to choose the long-break timer so that I can manage my long-breaking time.Acceptance Criteria: Ensure the user is able to: choose the long-break timer see the long-break timer chosen In addition to the above Epics and User Stories, you could create some more additionally. In this post, we'll create a React app based on the above Epics and User Stories. Next Time Let's take a break here and pick back up in the next post, starting with the wireframe for the project and code!","link":"/2020/05/15/tdd-with-react/"}],"tags":[{"name":"TDD","slug":"TDD","link":"/tags/TDD/"},{"name":"React","slug":"React","link":"/tags/React/"},{"name":"Jest","slug":"Jest","link":"/tags/Jest/"},{"name":"Enzyme","slug":"Enzyme","link":"/tags/Enzyme/"}],"categories":[{"name":"Development","slug":"Development","link":"/categories/Development/"}]}